Autodesk.Revit.DB.ExternalService.ExternalServiceId.op_Inequality(Autodesk.Revit.DB.ExternalService.ExternalServiceId,Autodesk.Revit.DB.ExternalService.ExternalServiceId)
Compares two ExternalServiceId instances.
first: The first ExternalServiceId.
second: The second ExternalServiceId.
Returns: True if the inputs are different, false if they are identical.

Autodesk.Revit.DB.ExternalService.ExternalServiceId.op_Equality(Autodesk.Revit.DB.ExternalService.ExternalServiceId,Autodesk.Revit.DB.ExternalService.ExternalServiceId)
Compares two ExternalServiceId instances.
first: The first ExternalServiceId.
second: The second ExternalServiceId.
Returns: True if the inputs are identical, false if they are different.

Autodesk.Revit.DB.ExternalService.ExternalServiceId.#ctor(System.Guid)
Creates a new ExternalServiceId instance.
guid: The identifier for the ExternalServiceId.

Autodesk.Revit.DB.ExternalService.ExternalServiceId
Unique identifier of an external service.
Remarks:
Each external service must have a unique ExternalServiceId.
The Id can be registered with Revit for servers to easily find it.
Unique ExternalServiceId should be created using GUID generation tool.
ExternalServiceId can later be used to access registered external services.
Since:
2013